packages/fluidsimfoam/fluidsimfoam-0.0.8.tar.gz/fluidsimfoam-0.0.8/tests/saved_cases/tiny-tgv/0/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}

dimensions    [0 2 -2 0 0 0 0];

internalField  #codeStream
{
    codeInclude
    #{
        #include "fvCFD.H"
    #};
    codeOptions
    #{
        -I$(LIB_SRC)/finiteVolume/lnInclude \
        -I$(LIB_SRC)/meshTools/lnInclude
    #};
    codeLibs
    #{
        -lmeshTools \
        -lfiniteVolume
    #};
    code
    #{
        const IOdictionary& d = static_cast<const IOdictionary&>(dict);
        const fvMesh& mesh = refCast<const fvMesh>(d.db());
        scalarField p(mesh.nCells(), 0.);
        forAll(p, i)
        {
            const scalar x = mesh.C()[i][0];
            const scalar y = mesh.C()[i][1];
            const scalar z = mesh.C()[i][2];
            p[i]=-0.0625*(Foam::cos(2*x) + Foam::cos(2*y))*Foam::cos(2*z+2);
        }
        p.writeEntry("",os);
    #};
};

boundaryField
{
    upperBoundary
    {
        type    cyclic;
    }
    lowerBoundary
    {
        type    cyclic;
    }
    leftBoundary
    {
        type    cyclic;
    }
    rightBoundary
    {
        type    cyclic;
    }
    frontBoundary
    {
        type    cyclic;
    }
    backBoundary
    {
        type    cyclic;
    }
}
